Revit 2021.1 API
InternalDefinition Methods
The InternalDefinition type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSpecTypeId
 Gets the identifier of the spec describing values of the parameter.
 (Inherited from Definition.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetAllowVaryBetweenGroups
 Whether or not the parameter values can vary across group members.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
InternalDefinition Class
Autodesk.Revit.DB Namespace